app/controllers/urls_controller.rb

  def create
    @url = Url.new(url_params)
    @url.sanitize
    if @url.new_url?
      if @url.save
        render :status => 200, :json => {:short_url => @url.short_url}
      else
        render :status => 412, :json => {:message => @url.errors.message}
      end
    else
      render :status => 200, :json => {:short_url => @url.find_duplicate.short_url}
---
INSERT INTO `urls` (`original_url`, `short_url`, `sanitized_url`, `created_at`, `updated_at`) VALUES ('https://www.google.com', 'LNTchp', 'https://google.com', '2019-06-15 06:16:51', '2019-06-15 06:16:51')
SELECT  `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'LNTchp' LIMIT 1

  def find_url
    @url = Url.find_by_short_url(params[:id])
---
SELECT  `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'urls' LIMIT 1