app/models/url.rb

SELECT  `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'LNTchp' LIMIT 1
---
  def generate_short_url
    chars = ['0'..'9','A'..'Z','a'..'z'].map{|range| range.to_a}.flatten
    # here we assign a short_url
    self.short_url = SHORT_URL_LENGTH.times.map{chars.sample}.join
    self.short_url = SHORT_URL_LENGTH.times.map{chars.sample}.join until Url.find_by_short_url(self.short_url).nil?

SELECT  `urls`.* FROM `urls` WHERE `urls`.`sanitized_url` = 'https://google.com' LIMIT 1
---
  def find_duplicate
    Url.find_by_sanitized_url(self.sanitized_url)